{
  "education": [
    {
      "degree": "Software Engineering (Dual Degree)",
      "institution": "ENSEA",
      "institutionLink": "https://www.ensea.fr",
      "duration": "2024 - 2026",
      "description": "I am currently pursuing a dual-degree program in computer engineering at the École Nationale\n                            Supérieure de l'Électronique et de ses Applications (ENSEA) in France, with a focus on\n                            embedded systems, software development, and AI. This program is part of a special\n                            partnership between ENSEA and my previous school, the École Nationale Supérieure\n                            d'Ingénieurs de Tunis (ENSIT). The partnership allows elite students to complete their\n                            second year of studies at ENSEA and finish their degree in France."
    },
    {
      "degree": "Software Engineering",
      "institution": "ENSIT",
      "institutionLink": "https://www.ensit.tn",
      "duration": "2022 - 2026",
      "description": "I am enrolled in the École Nationale Supérieure d'Ingénieurs de Tunis (ENSIT), having been\n                            accepted through the highly competitive concours spécifique for entry into engineering\n                            schools. While the standard program lasts three years, I am pursuing a four-year track due\n                            to my dual-degree program with ENSEA in France. During my first two years at ENSIT, I was\n                            the top student in both my promotion and the entire school, an achievement that granted me\n                            the opportunity to continue my studies in France through the partnership with ENSEA."
    },
    {
      "degree": "Bachelor in Software Engineering",
      "institution": "FSB",
      "institutionLink": "https://www.fsb.rnu.tn/",
      "duration": "2019 - 2022",
      "description": "I graduated in 2022 from the Faculty of Science of Bizerte with a degree in Software\n                            Engineering and Information Systems. Throughout the three years of my undergraduate studies,\n                            I consistently excelled academically, earning the title of top student in my class each\n                            year."
    },
    {
      "degree": "Baccalaureate in Mathematics",
      "institution": "ASSAD IBN EL FOURAT High School",
      "institutionLink": "https://ween.tn/fiche/lycee-assad-ibn-fourat",
      "duration": "2016 - 2019",
      "description": "I attended Assad Ibn El Fourat High School, where I graduated in 2019 with a Baccalaureate in\n                            Mathematics, earning the mention Assez Bien. I began my high school journey in 2016 in the\n                            second-year science stream, progressed to the third-year mathematics stream, and ultimately\n                            specialized in mathematics for my final year."
    },
    {
      "degree": "English C1 Level",
      "institution": "Amideast",
      "institutionLink": "https://www.amideast.org/tunisia",
      "duration": "2016 - 2018",
      "description": "Enrolled at AMIDEAST Tunisia in 2016, initially starting with an A2 level of proficiency in\n                            the language. Over the course of two years, I dedicated myself to improving my skills and\n                            successfully achieved a C1 level."
    },
    {
      "degree": "Oued Ellil High School",
      "institution": "",
      "institutionLink": "",
      "duration": "2015 - 2016",
      "description": "I initially attended Oued Ellil High School in 2015, where I completed my first year of\n                            secondary education before transferring to Assad Ibn El Fourat High School to continue my\n                            studies."
    },
    {
      "degree": "CHEBAW College",
      "institution": "",
      "institutionLink": "",
      "duration": "2012 - 2015",
      "description": "I studied at Chebbaw Middle School from 2012 to 2015, which is the educational level between\n                            primary school and high school."
    },
    {
      "degree": "RACHED Primary School",
      "institution": "",
      "institutionLink": "",
      "duration": "2006 - 2012",
      "description": "I began my education at Rached Primary School in Mannouba, where I studied from 2006,\n                            starting at the age of 6, until 2012."
    }
  ],
  "experience": [
    {
      "title": "PFA: Desktop app for Quiz Creation",
      "institution": "ENSEA",
      "institutionLink": "https://www.ensea.fr",
      "duration": "17/09/2024 - 01/04/2025",
      "description": "Developed a desktop application for creating quizzes and exams, inspired by the AMC\n                            application. The tool allows for the efficient creation of various question types and\n                            supports machine-based automatic grading, streamlining the assessment process. The project\n                            is currently in progress.",
      "technologies": ["JavaFX", "MySQL", "LaTeX"]
    },
    {
      "title": "PFA: GameDev for simulating student Life in ENSIT",
      "institution": "ENSIT",
      "institutionLink": "https://www.ensit.tn",
      "duration": "01/02/2024 - 02/05/2024",
      "description": "Developed a virtual tour application for the École Nationale Supérieure d'Ingénieurs de Tunis\n                            (ENSIT). The application allows users to explore the ENSIT campus through an immersive\n                            experience, offering interactive exploration. ",
      "technologies": ["C#", "Unity", "Blender", "Meshroom", "ReadyPlayerMe"]
    },
    {
      "title": "Summer Internship: Design and develop an automation application for Trading",
      "institution": "HELCHI Solution",
      "institutionLink": "https://www.dnb.com/business-directory/company-profiles.helchi_solution.0b81d3d875caafcd208af3946c312198.html",
      "duration": "01/06/2023 - 01/07/2023",
      "description": "Designed and developed an automation application for trading, utilizing algorithms such as\n                            Trix and Cocotier. After completing the initial tasks, implemented web scraping techniques\n                            to select the best products to trade from Amazon, enhancing the application’s functionality\n                            and decision-making process.",
      "technologies": ["Python", "Streamlit", "Selenium", "JungleScout"]
    },
    {
      "title": "PFA: E-Commerce Web and Mobile Dev",
      "institution": "ENSIT",
      "institutionLink": "https://www.ensit.tn",
      "duration": "02/02/2023 - 28/05/2023",
      "description": "This project involved building both the front-end and back-end components, ensuring seamless\n                            integration between the web and mobile platforms. The application aimed to provide a smooth\n                            user experience for browsing and purchasing products while ensuring efficient data\n                            management with MySQL.",
      "technologies": ["Angular", "Ionic6", "Spring", "MySql"]
    },
    {
      "title": "PFE: Design And Develop U-BooK Application",
      "institution": "FSB",
      "institutionLink": "https://www.fsb.rnu.tn",
      "duration": "01/02/2022 - 31/05/2022",
      "description": "Final Year Project (Bachelor's Degree in Computer Science and Engineering): Developed a\n                            university social media platform for exchanging documents and resources. The project\n                            consists of three main components: the entrepreneurial idea and business management, the\n                            development of the application’s infrastructure, and the integration of artificial\n                            intelligence to manage processes within the platform, enhancing its functionality and user\n                            experience.",
      "technologies": ["Angular", "Spring", "MySql", "Python", "SickitLearn"]
    },
    {
      "title": "Freelance",
      "institution": "",
      "institutionLink": "",
      "duration": "2022",
      "description": "Freelance work in media editing, including picture and video editing, as well as in the\n                            development of applications and algorithms. These projects provided valuable experience and\n                            financial support, serving as a starting point for my career.",
      "technologies": []
    }
  ]
}
