{
  "socialActivities": [
    {
      "title": "ENSIT and Tunisia Ambassador in France",
      "title2": "An international Ambassador",
      "articleTitle": "Ambassador",
      "image": "/portfolio/social/Presenting%20Tunisia/0.jpg",
      "id": "Presenting Tunisia",
      "description": "I had the distinct honor of being selected as the ENSIT and Tunisia Ambassador at ENSEA France, where I was tasked with inviting second-year students to consider pursuing a double degree at my home institution, ENSIT. Representing my school in a foreign country was an immense privilege, and it filled me with pride to present the opportunities offered by ENSIT to my peers at ENSEA. It was a great honor to step outside of my comfort zone, surpass my own limits, and present everything in a language that was not my mother tongue. This experience not only allowed me to strengthen my leadership skills but also deepened my connection to both my school and my home country, showcasing the international collaboration between ENSIT and ENSEA.",
      "images": [
        "portfolio/social/Presenting%20Tunisia/0.jpg",
        "portfolio/social/Presenting%20Tunisia/1.jpg",
        "portfolio/social/Presenting%20Tunisia/2.jpg",
        "portfolio/social/Presenting%20Tunisia/3.jpg"
      ],
      "videos": [
      "portfolio/social/Presenting%20Tunisia/4.mp4",
      "portfolio/social/Presenting%20Tunisia/5.mp4"
      ]
    },
    {
      "title": "ENSIT Computer Science Responsable",
      "title2": "Computer Science Class Responsible",
      "articleTitle": "Study_Travel",
      "image": "/portfolio/social/Voyage%20d'etude/0.jpg",
      "id": "Voyage d'etude",
      "description": "I have always taken on the role of Computer Science class representative throughout my academic journey. I consistently assumed responsibility for representing my class, ensuring smooth communication between students and teachers, and keeping everyone informed. Additionally, I served as the primary liaison between the ENSIT administration and my class during our study trip in the second year. Acting as both a communicator and coordinator, I have always been the go-to person for organizing, relaying information, and maintaining a strong connection between students and faculty.",
      "images": [
        "portfolio/social/Voyage%20d'etude/0.jpg",
        "portfolio/social/Voyage%20d'etude/1.jpg",
        "portfolio/social/Voyage%20d'etude/2.jpg"
      ],
      "videos": [
        "portfolio/social/Voyage%20d'etude/3.mp4"
      ]
    },
    {
      "title": "Insight Of ENSIT 9.0 Presenter",
      "title2": "ENSIT Forum",
      "articleTitle": "ENSIT Forum",
      "image": "/portfolio/social/Insight%20of%20Ensit2/1.jpg",
      "id": "Insight of Ensit2",
      "description": "Insight of ENSIT 9th Edition was a true challenge for me. On November 15th, in the Cultural City of Chedli El Klibi, I had the honor of presenting the event in Arabic for 5 hours in front of more than 500 attendees, including teachers, students, and professionals like CEOs and politicians. At first, the idea of speaking in front of such a large and distinguished audience was daunting, but once I said my first word, I found it surprisingly easy to continue. It became an iconic moment in my experience, one that greatly shaped my public speaking and presentation skills.",
      "images": [
        "portfolio/social/Insight%20of%20Ensit2/0.JPG",
        "portfolio/social/Insight%20of%20Ensit2/1.jpg",
        "portfolio/social/Insight%20of%20Ensit2/2.jpg",
        "portfolio/social/Insight%20of%20Ensit2/3.jpeg",
        "portfolio/social/Insight%20of%20Ensit2/4.jpeg",
        "portfolio/social/Insight%20of%20Ensit2/5.jpeg",
        "portfolio/social/Insight%20of%20Ensit2/6.jpeg",
        "portfolio/social/Insight%20of%20Ensit2/7.JPG",
        "portfolio/social/Insight%20of%20Ensit2/8.JPG",
        "portfolio/social/Insight%20of%20Ensit2/9.jpeg"
      ],
      "videos": [
        "portfolio/social/Insight%20of%20Ensit2/10.mp4",
        "portfolio/social/Insight%20of%20Ensit2/11.mp4",
        "portfolio/social/Insight%20of%20Ensit2/12.mp4"
      ]
    },
    {
      "title": "Events Ambassador",
      "title2": "A socially engaged person.",
      "articleTitle": "Ambassador",
      "image": "/portfolio/social/Ambassador/6.jpg",
      "id": "ambassador",
      "description": "I have actively participated in a variety of events as an ambassador, where I took on leadership\n                    roles and contributed significantly to the success of each initiative. Throughout these experiences,\n                    I have demonstrated strong communication, organizational, and leadership skills while engaging with\n                    diverse audiences and fostering collaboration. My dedication and impact were recognized multiple\n                    times, as I was honored with Best Ambassador awards on several occasions. These achievements reflect\n                    my commitment to promoting and representing key projects, events, and organizations, ensuring their\n                    growth and visibility in various domains.",
      "images": [
        "portfolio/social/Ambassador/0.JPG",
        "portfolio/social/Ambassador/1.jpg",
        "portfolio/social/Ambassador/2.JPG",
        "portfolio/social/Ambassador/3.jpg",
        "portfolio/social/Ambassador/4.jpg",
        "portfolio/social/Ambassador/5.jpg",
        "portfolio/social/Ambassador/6.jpg",
        "portfolio/social/Ambassador/7.jpeg"
      ],
      "videos": []
    },
    {
      "title": "IEEEXtreme17.0 ENSIT Manager",
      "title2": "IEEEXtreme 17.0",
      "articleTitle": "IEEEXtreme",
      "image": "/portfolio/social/IEEEXtreme17/0.jpg",
      "id": "IEEEXtreme17",
      "description": "As Chair of IEEE ENSIT CS SBC, I led all aspects of the IEEEXtreme 17.0 event for our Student Branch, overseeing marketing, logistics, sponsorship, event coordination, and ambassador management. The event took place over 24 hours, from October 28 to 29, 2023, at our sponsor MIT Local. It was a spectacular event, filled with fun and excitement, though it also came with its challenges. Managing every detail of the event brought a lot of stress, but it was a rewarding experience that allowed me to develop crucial management and communication skills while ensuring the event ran smoothly.",
      "images": [
        "portfolio/social/IEEEXtreme17/0.jpg",
        "portfolio/social/IEEEXtreme17/1.JPG",
        "portfolio/social/IEEEXtreme17/2.JPG",
        "portfolio/social/IEEEXtreme17/3.JPG",
        "portfolio/social/IEEEXtreme17/4.jpeg"
      ],
      "videos": [
        "portfolio/social/IEEEXtreme17/4.mp4",
        "portfolio/social/IEEEXtreme17/5.mp4"
      ]
    },
    {
      "title2": "IEEE 101 Bel tounsy Editor and Presenter",
      "title": "IEEE 101 بل تونسي",
      "articleTitle": "IEEE 101",
      "image": "/portfolio/social/IEEE%20101/0.jpg",
      "id": "IEEE 101",
      "description": "As Chair of the IEEE ENSIT CS Student Branch Chapter, I contributed to the IEEE 101 project, an initiative inspired by the IEEE 101 Egyptian version, where we introduced IEEE concepts in Tunisian dialect to make them more accessible. Our Student Branch decided to launch this project, and I took on the role of video editor for most of the content. Additionally, I was responsible for the narration of the IEEEXtreme 17.0 video, helping to bring the project to life and make IEEE more engaging for our local community.",
      "images": [
        "portfolio/social/IEEE%20101/0.jpg"
      ],
      "videos": [
        "portfolio/social/IEEE%20101/1.mp4",
        "portfolio/social/IEEE%20101/2.mp4",
        "portfolio/social/IEEE%20101/3.mp4",
        "portfolio/social/IEEE%20101/4.mp4"
      ]
    },
    {
      "title": "IEEE ENSIT CS SBC Chair",
      "title2": "IEEE ENSIT",
      "articleTitle": "IEEE ENSIT",
      "image": "/portfolio/social/IEEE%20CS%20Chair/0.jpg",
      "id": "IEEE CS Chair",
      "description": "In 2023, I was elected as the Chair of the IEEE ENSIT CS Student Branch Chapter, leading the IT group of the club. During my tenure, I achieved several milestones, including developing the IEEE ENSIT SB website with my dev team and creating a typing game, which we showcased on our website. I also organized multiple training sessions and played a key role in preparing for IEEEXtreme 17.0, one of the most significant IEEE CS competitions. Additionally, I led our team at TSYP11, where the IEEE CS Chapter of ENSIT was the only one from our school to win a prize till that date.",
      "images": [
        "portfolio/social/IEEE%20CS%20Chair/0.jpg",
        "portfolio/social/IEEE%20CS%20Chair/1.jpg",
        "portfolio/social/IEEE%20CS%20Chair/2.jpg",
        "portfolio/social/IEEE%20CS%20Chair/3.jpg"
      ],
      "videos": [
        "portfolio/social/IEEE%20CS%20Chair/4.mp4",
        "portfolio/social/IEEE%20CS%20Chair/5.mp4"
      ]
    },
    {
      "title": "ENSIT Geeks Club Project Manager",
      "title2": "ENSIT GEEKS",
      "articleTitle": "ENSIT Geeks",
      "image": "/portfolio/social/Geeks%20Project%20Manager/0.jpg",
      "id": "Geeks Project Manager",
      "description": "In 2023, I was elected as the Project Manager of ENSIT Geeks Club, where I led and organized various impactful initiatives. I developed a club website to showcase our activities and presence in the field, as well as a website for our partner, Tunis Sports University. Additionally, I launched the ENSIT Geeks Club Store, where we sold products like stickers, hoodies, services, and other club-related items. I also developed the Geekshack3 application and, alongside my co-Project Manager, organized several problem-solving quests, fostering innovation and engagement within the club.",
      "images": [
        "portfolio/social/Geeks%20Project%20Manager/0.jpg",
        "portfolio/social/Geeks%20Project%20Manager/1.jpg",
        "portfolio/social/Geeks%20Project%20Manager/2.jpg",
        "portfolio/social/Geeks%20Project%20Manager/3.jpg",
        "portfolio/social/Geeks%20Project%20Manager/4.jpg",
        "portfolio/social/Geeks%20Project%20Manager/5.jpg",
        "portfolio/social/Geeks%20Project%20Manager/6.jpg",
        "portfolio/social/Geeks%20Project%20Manager/7.jpeg"
      ],
      "videos": [
        "portfolio/social/Geeks%20Project%20Manager/10.mp4"
      ]
    },
    {
      "title": "ENACTUS ENSIT Marketing Manager",
      "title2": "ENACTUS ENSIT",
      "articleTitle": "ENACTUS",
      "image": "/portfolio/social/Enactus%20Ensit/0.jpg",
      "id": "Enactus Ensit",
      "description": "I served as the Marketing Manager of Enactus ENSIT for a short but crucial period in 2022, with the goal of reviving the club within the school. During my one-semester tenure, I focused on creating engaging marketing videos and motivational content to attract and inspire new members, helping to rebuild the club’s presence and impact.",
      "images": [
        "portfolio/social/Enactus%20Ensit/0.jpg",
        "portfolio/social/Enactus%20Ensit/1.jpg"
      ],
      "videos": [
        "portfolio/social/Enactus%20Ensit/1.mp4",
        "portfolio/social/Enactus%20Ensit/2.mp4"
      ]
    },
    {
      "title": "ATIA Machine Learning Bootcamp",
      "title2": "A socially engaged person",
      "articleTitle": "Bootcamp",
      "image": "/portfolio/social/ATIA%20ML/0.jpg",
      "id": "ATIA ML",
      "description": "I participated in the ATIA Machine Learning Bootcamp at the Carthage Thalasso Gammarth 5-star hotel from August 23 to 25, 2022, an enriching experience that blended both learning and enjoyment. The bootcamp focused on medium-level Machine Learning, providing valuable insights and hands-on practice. Beyond the technical aspect, it was an opportunity to meet many amazing people, exchange ideas, and build connections. The atmosphere was both professional and enjoyable, making it a perfect balance between gaining knowledge and having fun, from engaging sessions to chilling with friends in a great setting.",
      "images": [
        "portfolio/social/ATIA%20ML/0.jpg",
        "portfolio/social/ATIA%20ML/2.jpg",
        "portfolio/social/ATIA%20ML/3.jpg",
        "portfolio/social/ATIA%20ML/4.jpg",
        "portfolio/social/ATIA%20ML/5.jpg"
      ],
      "videos": []
    },
    {
      "title": "Oxfam  Bootcamp Participant",
      "articleTitle": "Bootcamp",
      "title2": "OXFAM Social Entrepreneurship",
      "image": "/portfolio/social/Oxfam/0.jpg",
      "id": "Oxfam",
      "description": "I participated in the Social Entrepreneurship Bootcamp at the Mehari 5-star Hotel, held from June 17 to 19, 2022. This bootcamp was a fantastic blend of learning and personal growth, focusing on social entrepreneurship. It offered valuable insights into building sustainable projects with a social impact. Beyond the workshops and training sessions, I had the chance to meet inspiring individuals, exchange ideas, and build connections that have been valuable in my professional journey. The event was a great mix of knowledge sharing and networking, all while enjoying a vibrant atmosphere.",
      "images": [
        "portfolio/social/Oxfam/0.jpg",
        "portfolio/social/Oxfam/1.jpg",
        "portfolio/social/Oxfam/2.jpg"
      ],
      "videos": [
        "portfolio/social/Oxfam/3.mp4",
        "portfolio/social/Oxfam/4.mp4"
      ]
    },
    {
      "title": "FSB Integration Day Presenter",
      "articleTitle": "Integration",
      "image": "/portfolio/social/FSB%20Integration%20Day/0.jpg",
      "id": "FSB Integration Day",
      "description": "On September 16, 2021, I had my first-ever experience presenting an event in front of more than 100 people during FSB Integration Day. The event was planned by me and the IT department of FSB to welcome new students in the IT field. At first, I felt stressed, especially since I was presenting in front of my own professors, requiring a high level of professionalism. However, as I got into it, I became more comfortable, and the presentation went smoothly, making it a successful and memorable experience.",
      "images": [
        "portfolio/social/FSB%20Integration%20Day/0.jpg",
        "portfolio/social/FSB%20Integration%20Day/1.jpg",
        "portfolio/social/FSB%20Integration%20Day/2.jpeg"
      ],
      "videos": [
        "portfolio/social/FSB%20Integration%20Day/5.mp4"
      ]
    },
    {
      "title": "ENACTUS & 4C FSB Member",
      "articleTitle": "ENACTUS & 4C",
      "image": "/portfolio/social/Enactus%20FSB%20and%204C/0.jpg",
      "id": "Enactus FSB and 4C",
      "description": "I was actively involved at FSB for three years, starting with Enactus in my first year, where I participated in national events, workshops, and training sessions, gaining valuable entrepreneurial skills. While remaining active in Enactus, I was also selected as a 4C junior member, alongside five other students. In this role, we led groups, shared knowledge, and guided fellow students, contributing to a collaborative and enriching learning environment.",
      "images": [
        "portfolio/social/Enactus%20FSB%20and%204C/0.jpg",
        "portfolio/social/Enactus%20FSB%20and%204C/1.jpg",
        "portfolio/social/Enactus%20FSB%20and%204C/2.jpg",
        "portfolio/social/Enactus%20FSB%20and%204C/3.jpg"
      ],
      "videos": []
    }
  ]
}
